---
title: 翻訳のクイックガイド
---

## リポジトリをforkする

1. “Fork” ボタンをクリックします

![](fork_button.png)

## あなたの fork を CloneもしくはDownload する

1. あなたのアカウントのi18nリポジトリにいることを確認します
1. “Clone” をクリックします
1. “HTTPS” をクリックします
1. クリップボードのアイコンをクリックします (これでURLがコピーされます)
1. ターミナル(もしくはコマンドプロンプト)に移動し “git clone <コピーしたURLをここに貼り付ける>” を実行します
1. “i18n” フォルダができていることを確認します

![](clone1234.png)

![](clone56.png)

## どのレッスンを翻訳するか決める

1. SWC-jaの i18n リポジトリに移動します
1. “Issues” をクリックします
1. タイトルに “Translation:” がある issue のどれかをクリックします
1. 説明を読みます
1. この issue にコメントし、あなたがこの翻訳に取り組むことをSWC-jaのメンバーに知らせます (コメントの例:「私はこれに取り組みます!!」)

![](which_lesson123.png)

![](which_lesson45.png)

## 翻訳する

1. “i18n” フォルダに移動します
1. “po” フォルダに移動します
1. “.ja.po” のファイル拡張子も持つファイルを見つけます
1. “.ja.po” ファイルをお気に入りのPOエディターで翻訳するか、直接編集します

![](translate123.png)

## ファイルを直接編集する場合

1. “msgid” は変更しないようにします
1. “msgstr” ブロックの""の内(間)を翻訳します

![](directly_editing12.png)

![](example_translation.png)
